update base knowlegde
